<a href="https://colab.research.google.com/github/jestfulfalcon/test1/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.22.4 in /usr/local/lib/python3.10/dist-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.__version__

'2.1.4'

**CREATING SERIES**

In [ ]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
pd.Series(index = ['Eshant', 'Pranjal', 'Jayesh', 'Ashish'], data = [1,2,3,4])

Eshant     1
Pranjal    2
Jayesh     3
Ashish     4
dtype: int64

**Series through Dictionary Values**

In [ ]:
steps={'day 1 : ' : 4000 , 'day 2 :' : 5000 , 'day 3 :' : 6000 , 'day 4 :' : 7000 , 'day 5 :' : 8000}
pd.Series(steps)

day 1 :     4000
day 2 :     5000
day 3 :     6000
day 4 :     7000
day 5 :     8000
dtype: int64

**Using repeat function along with creating a Series**

In [ ]:
pd.Series(5).repeat(7) # by default indexes are same

0    5
0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [ ]:
pd.Series(5).repeat(7).reset_index( drop = True)

0    5
1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64

In [ ]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)

**Accessing Elements**

In [ ]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

**Aggregate function on pandas Series**

In [ ]:
sr=pd.Series([1,2,3,4,5,6,7])
sr.agg([min,max,sum])

<ipython-input-13-1fa38c629853>:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
<ipython-input-13-1fa38c629853>:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
<ipython-input-13-1fa38c629853>:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

**Series absolute function**

In [ ]:
sr = pd.Series([1,-2,3,-4,5,-6,7])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

**CONACATENATING SERIES**

In [ ]:
import pandas as pd

sr1 = pd.Series([1, 2, 3])
sr2 = pd.Series([1, 2, 3])

# Use pd.concat() to combine the Series
sr3 = pd.concat([sr2, sr1])
sr3.reset_index(drop=True)

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

**As Type Function**

In [ ]:
sr1

0    1
1    2
2    3
dtype: int64

In [ ]:
type(sr1)

pandas.core.series.Series

In [ ]:
sr1.astype('float')

0    1.0
1    2.0
2    3.0
dtype: float64

In [ ]:
sr1.astype('string')

0    1
1    2
2    3
dtype: string

**Between Function**

In [ ]:

sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [ ]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

**b All strings functions can be used to extract or modify texts in a series**
 Upper and Lower Function

 Len function

 Strip Function

 Split Function

 Contains Function

 Replace Function

 Count Function

 Startswith and Endswith Function

 Find Finction

In [ ]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])

In [ ]:
print(ser.str.upper())

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object

In [ ]:
print(ser.str.lower())

0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [ ]:
for i in ser:
  print(len(i))

10
12
15
11
16

In [ ]:
ser = pd.Series(["  Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning  '])

ser = ser.str.strip()

for i in ser:
    print(i , len(i))

Eshant Das 10
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning 16

In [ ]:
ser.str.split()

0          [Eshant, Das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

In [ ]:
ser.str.split()[1]

['Data', 'Science']

In [ ]:
ser = pd.Series(["Eshant Das","Data@Science","Geeks for Geeks",'Hello@World','Machine Learning'])

ser.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [ ]:

ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [ ]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [ ]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [ ]:

ser.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64